app/controllers/entries_controller.rb

INSERT INTO "entries" ("user_id", "title", "comment", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        entry = @current_user.entries.create!(entry_params)

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."id" = ? LIMIT ?  [["user_id", 8], ["id", 37], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 37]]
---
    def destroy
        entry = @current_user.entries.find_by(id: params[:id])
        if entry
        entry.destroy

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."id" = ? LIMIT ?  [["user_id", 1], ["id", 33], ["LIMIT", 1]]
UPDATE "entries" SET "rating" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["rating", 6], ["updated_at", "2021-10-07 18:56:39.080678"], ["id", 13]]
---
    def update
        entry = @current_user.entries.find_by(id: params[:id])
        if entry.rating < 10
            entry.rating = entry.rating + 1
            entry.save